namespace ASI.TCL.CMFT.WPF.Module.DMD.DataTypes
{
    public enum eATSType
    {
        雙線雙向_一般車_中間站
        , 雙線雙向_一般車_終點站
        , 雙線雙向_末班車_中間站
        , 雙線雙向_末班車_終點站
        , 雙線雙向_不停靠_中間站
        , 雙線雙向_不停靠_終點站
        , 雙線雙向_不載客_中間站
        , 雙線雙向_不載客_終點站
        , 雙線雙向_不停靠不載客_中間站
        , 雙線雙向_不停靠不載客_終點站
        , 單線雙向_一般車_中間站
        , 單線雙向_一般車_終點站
        , 單線雙向_末班車_中間站
        , 單線雙向_末班車_終點站
        , 單線雙向_不停靠_中間站
        , 單線雙向_不停靠_終點站
        , 單線雙向_不載客_中間站
        , 單線雙向_不載客_終點站
        , 單線雙向_不停靠不載客_中間站
        , 單線雙向_不停靠不載客_終點站
        , 列車已停靠月台_起始站_二輛列車已停靠月台
        , 列車已停靠月台_起始站_一輛列車已停靠月台
        , 列車已停靠月台非起始站
        , 月台未開放
        , 列車停靠異常
        , 月台狀態異常
        , 列車狀態異常
    }
}